// - створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     EXAMPLE:
// [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

let nums = ['a', 'b', 'c'];
nums.push(1, 2, 3);
console.log(nums);

let nums1 = [1, 2, 3];
nums1.reverse();
console.log(nums1);

let nums2 = [1, 2, 3];
nums2.push(4, 5, 6);
console.log(nums2);

let nums3 = [1, 2, 3];
nums3.unshift(4, 5, 6);
console.log(nums3);

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c'].

let nums4 = [1, 2, 3, 4, 5];
let spl = nums4.splice(0, 3);
console.log(nums4);

let nums5 = [1, 2, 3, 4, 5];
let spl1 = nums5.splice(2, 3);
console.log(nums5);

let nums6 = [1, 2, 3, 4, 5];
let spl2 = nums6.splice(3, 2, 'a', 'b', 'c');
console.log(nums6);

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

let numbers = [3,10,15,21,29,36,45,58,60,77];
for (let i=0; i<numbers.length; i++){
    if (numbers[i]%2 === 0){
        console.log(numbers[i]);
    }
}
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу скопіювати значення одного масиву в інший.

let numbers1 = [3,10,15,21,29,36,45,58,60,77];
let numbers2 = [];
for (let a = 0; a < numbers1.length; a++){
    numbers2[a] = numbers1[a];
}
console.log(numbers2);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
let abc = [ 'a', 'b', 'c'];
let full = "";
for (let a = 0; a < abc.length; a++){
    full = full + abc[a];
}
console.log(full);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// while (a<abc.length){
//
//     full = full + abc[a];
//     a++;
// };
// console.log(full);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
abc = [ 'a', 'b', 'c'];
full = "";
for (const string of abc){
    full = full + string
}
console.log(full);



